Code refactor and minor fixes
